Po220/AI_Chat_ESP32/components/my_board/my_board_v1_0/board_pins_config.c

/*
 * ESPRESSIF MIT License
 *
 * Copyright (c) 2020 <ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD>
 *
 * Permission is hereby granted for use on all ESPRESSIF SYSTEMS products, in which case,
 * it is free of charge, to any person obtaining a copy of this software and associated
 * documentation files (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the Software is furnished
 * to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or
 * substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 */

 #include "esp_log.h"
 #include "driver/gpio.h"
 #include <string.h>
 #include "board.h"
 #include "audio_error.h"
 #include "audio_mem.h"
 #include "soc/soc_caps.h"
 
 static const char *TAG = "MY_BOARD_V1_0";
 
 esp_err_t get_i2c_pins(i2c_port_t port, i2c_config_t *i2c_config)
 {
     AUDIO_NULL_CHECK(TAG, i2c_config, return ESP_FAIL);
     if (port == I2C_NUM_0) {
         i2c_config->sda_io_num = 42;
         i2c_config->scl_io_num = 41;
     } else {
         i2c_config->sda_io_num = -1;
         i2c_config->scl_io_num = -1;
         ESP_LOGE(TAG, "i2c port %d is not supported", port);
         return ESP_FAIL;
     }
     return ESP_OK;
 }
 
 esp_err_t get_i2s_pins(int port, board_i2s_pin_t *i2s_config)
 {
     AUDIO_NULL_CHECK(TAG, i2s_config, return ESP_FAIL);
     if (port == 0) {
         i2s_config->mck_io_num = GPIO_NUM_40;
         i2s_config->bck_io_num = GPIO_NUM_0;
         i2s_config->ws_io_num = GPIO_NUM_2;
         i2s_config->data_out_num = GPIO_NUM_1;
         i2s_config->data_in_num = GPIO_NUM_45;
     } else if (port == 1) {
         i2s_config->bck_io_num = -1;
         i2s_config->ws_io_num = -1;
         i2s_config->data_out_num = -1;
         i2s_config->data_in_num = -1;
     } else {
         memset(i2s_config, -1, sizeof(board_i2s_pin_t));
         ESP_LOGE(TAG, "i2s port %d is not supported", port);
         return ESP_FAIL;
     }
 
     return ESP_OK;
 }
 
 // pa enable
 int8_t get_pa_enable_gpio(void)
 {
     return PA_ENABLE_GPIO;
 }
 
 // rec button
 int8_t get_input_rec_id(void)
 {
     return BUTTON_REC_ID;
 }
 
 // mode button
 int8_t get_input_mode_id(void)
 {
     return BUTTON_MODE_ID;
 }
 
 int8_t get_es8311_mclk_src(void)
 {
     return ES8311_MCLK_SOURCE;
 }